Examinator/src/Catalogs/ГлоссарииСУЗ/ГлоссарииСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГлоссарииСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьАлфавит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСОпределением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ГруппыОбъектовСУЗ/ГруппыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СодержаниеГлоссарияСУЗ/СодержаниеГлоссарияСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеГлоссарияСУЗ</name>
  <owners>Catalog.ГлоссарииСУЗ</owners>
  <attributes>
    <name>ТерминГлоссария</name>
    <type>
      <types>CatalogRef.ТерминыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьАвтоСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыСУЗ/ТерминыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ГлоссарииСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.glossary;
	
КонецФункции
                  
// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Глоссарий, ПараметрыСсылки, КонтекстВыполнения) Экспорт

	ИмяОбъектаСУЗ = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	
	XMLДанные = "<ОбъектСУЗ>";
	БукваДляФильтра = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "letter"); 
	
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%90", "А");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%91", "Б");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%92", "В");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%93", "Г");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%94", "Д");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%95", "Е");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%96", "Ж");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%97", "З");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%98", "И");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9A", "К");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9B", "Л");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9C", "М");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9D", "Н");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9E", "О");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%9F", "П");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A0", "Р");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A1", "С");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A2", "Т");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A3", "У");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A4", "Ф");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A5", "Х");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A6", "Ц");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A7", "Ч");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A8", "Ш");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%A9", "Щ");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%AD", "Э");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%AE", "Ю");
	БукваДляФильтра = СтрЗаменить(БукваДляФильтра, "%D0%AF", "Я");
	
	Если БукваДляФильтра = "%D0%B2%D1%81%D0%B5" Тогда
		БукваДляФильтра = "все";
	КонецЕсли;
	
	Если Глоссарий.ПоказыватьАлфавит = Ложь  Тогда
		БукваДляФильтра = "все";
	КонецЕсли; 
	

	XMLДанные = XMLДанные + "<Глоссарий id="""+    
	Глоссарий.УникальныйИдентификатор() +""" object="""+ ИмяОбъектаСУЗ 
			+"""  Наименование="""+ СтрЗаменить(Глоссарий.Наименование, """", "") +""" БукваДляФильтра="""+БукваДляФильтра+""">"; 
	XMLДанные = XMLДанные + "<ТерминыГлоссария>";			
	
	XMLДанные = XMLДанные + "
		|	<БукваДляПоиска><![CDATA["+ БукваДляФильтра +"]]></БукваДляПоиска>";


	
	XMLДанные = XMLДанные + "
		|<НастройкаГлоссария>
		|	<ОпределениеТермина>"+ ?(Глоссарий.ПоказыватьСОпределением, "истина", "ложь") +"</ОпределениеТермина>
		|   <НаличиеАлфавита>"+ ?(Глоссарий.ПоказыватьАлфавит, "истина", "ложь") +"</НаличиеАлфавита>
		|</НастройкаГлоссария>";

		
			
    // Алфавит в массив	
	МассивВесьАлфавит = Новый Массив();

	МассивВесьАлфавит.Добавить("А");
	МассивВесьАлфавит.Добавить("Б");
	МассивВесьАлфавит.Добавить("В");
    МассивВесьАлфавит.Добавить("Г");
	МассивВесьАлфавит.Добавить("Д");
	МассивВесьАлфавит.Добавить("Е");
	МассивВесьАлфавит.Добавить("Ж");
 	МассивВесьАлфавит.Добавить("З");
 	МассивВесьАлфавит.Добавить("И");
 	МассивВесьАлфавит.Добавить("К");
 	МассивВесьАлфавит.Добавить("Л");
 	МассивВесьАлфавит.Добавить("М");
 	МассивВесьАлфавит.Добавить("Н");
 	МассивВесьАлфавит.Добавить("О");
 	МассивВесьАлфавит.Добавить("П");
 	МассивВесьАлфавит.Добавить("Р");
	МассивВесьАлфавит.Добавить("С");
	МассивВесьАлфавит.Добавить("Т");
 	МассивВесьАлфавит.Добавить("У");
 	МассивВесьАлфавит.Добавить("Ф");
 	МассивВесьАлфавит.Добавить("Х");
 	МассивВесьАлфавит.Добавить("Ц");
	МассивВесьАлфавит.Добавить("Ч");
 	МассивВесьАлфавит.Добавить("Ш");
 	МассивВесьАлфавит.Добавить("Щ");
 	МассивВесьАлфавит.Добавить("Э");
	МассивВесьАлфавит.Добавить("Ю");
 	МассивВесьАлфавит.Добавить("Я");


     МассивЦифры = Новый Массив();
	 
	 МассивЦифры.Добавить("0");
	 МассивЦифры.Добавить("1");
	 МассивЦифры.Добавить("2");
	 МассивЦифры.Добавить("3");
     МассивЦифры.Добавить("4");
     МассивЦифры.Добавить("5");
     МассивЦифры.Добавить("6");
     МассивЦифры.Добавить("7");
     МассивЦифры.Добавить("8");
     МассивЦифры.Добавить("9");
            
			
	МассивАнглАлфавит = Новый Массив();
    МассивАнглАлфавит.Добавить("A");
    МассивАнглАлфавит.Добавить("B");
	МассивАнглАлфавит.Добавить("C");
	МассивАнглАлфавит.Добавить("D");
	МассивАнглАлфавит.Добавить("E");
	МассивАнглАлфавит.Добавить("F");
	МассивАнглАлфавит.Добавить("G");
	МассивАнглАлфавит.Добавить("H");
	МассивАнглАлфавит.Добавить("I");
	МассивАнглАлфавит.Добавить("J");
	МассивАнглАлфавит.Добавить("K");
	МассивАнглАлфавит.Добавить("L");
	МассивАнглАлфавит.Добавить("M");
	МассивАнглАлфавит.Добавить("N");
	МассивАнглАлфавит.Добавить("O");
	МассивАнглАлфавит.Добавить("P");
	МассивАнглАлфавит.Добавить("Q");
	МассивАнглАлфавит.Добавить("R");
	МассивАнглАлфавит.Добавить("S");
	МассивАнглАлфавит.Добавить("T");
	МассивАнглАлфавит.Добавить("U");
	МассивАнглАлфавит.Добавить("V");
	МассивАнглАлфавит.Добавить("W");
	МассивАнглАлфавит.Добавить("X");
	МассивАнглАлфавит.Добавить("Y");
	МассивАнглАлфавит.Добавить("Z");
		 

	Запрос = Новый Запрос("ВЫБРАТЬ
		|СодержаниеГлоссария.ТерминГлоссария,
		|ТерминыСУЗ.Наименование,
		|ТерминыСУЗ.БукваДляПоиска,
		|ТерминыСУЗ.Ссылка КАК Ссылка
		|	ИЗ
		|Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссария
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТерминыСУЗ КАК ТерминыСУЗ
		|ПО СодержаниеГлоссария.ТерминГлоссария = ТерминыСУЗ.Ссылка
		|	ГДЕ
		|СодержаниеГлоссария.ПометкаУдаления = &ПометкаУдаления
		|И СодержаниеГлоссария.Владелец = &Владелец
		|И ТерминыСУЗ.ПометкаУдаления = &ПометкаУдаления

		|СГРУППИРОВАТЬ ПО
		|СодержаниеГлоссария.ТерминГлоссария,
		|ТерминыСУЗ.Наименование,
		|ТерминыСУЗ.БукваДляПоиска,
		|ТерминыСУЗ.Ссылка");


	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("Владелец", Глоссарий);
	
	// все элементы (буквы/слова) глоссария
	МассивБукв = Новый Массив();

	ТерминыГлоссария = Запрос.Выполнить().Выбрать();
		
	Пока ТерминыГлоссария.Следующий() Цикл
				
		МассивБукв.Добавить(ТерминыГлоссария.БукваДляПоиска);

		// вытаскиваем буквы для поиска из ПредставленияПонятия
		КоличествоВариантов =0;		
		Для каждого Вариант Из ТерминыГлоссария.Ссылка.Синонимы Цикл
			МассивБукв.Добавить(Вариант.БукваДляПоиска);
			КоличествоВариантов= КоличествоВариантов +1;
        КонецЦикла;
		
		
		Если (ТерминыГлоссария.БукваДляПоиска = БукваДляФильтра ИЛИ БукваДляФильтра = "все") Тогда
			
			СтруктураДанныхОбъектСУЗТермина = ОбъектыСУЗ.ПолучитьПредставление(ТерминыГлоссария.Ссылка, ПараметрыСсылки, КонтекстВыполнения);
			
			Если Глоссарий.ПоказыватьСОпределением Тогда
				XMLДанные = XMLДанные + "
					|<ТерминГлоссария id="""+ ТерминыГлоссария.Ссылка.УникальныйИдентификатор() +""">
					|<Наименование><![CDATA["+ ТерминыГлоссария.Наименование +"]]></Наименование>
					|<Буква><![CDATA["+ ТерминыГлоссария.БукваДляПоиска +"]]></Буква>
					|<Представление><![CDATA["+ СтруктураДанныхОбъектСУЗТермина.Представление +"]]></Представление>
					|<Скрипт><![CDATA["+ СтруктураДанныхОбъектСУЗТермина.Скрипт +"]]></Скрипт>
					|</ТерминГлоссария>";
			Иначе
				XMLДанные = XMLДанные + "
					|<ТерминГлоссария id="""+ ТерминыГлоссария.Ссылка.УникальныйИдентификатор() +""">
					|<Наименование><![CDATA["+ ТерминыГлоссария.Наименование +"]]></Наименование>
					|<Буква><![CDATA["+ ТерминыГлоссария.БукваДляПоиска +"]]></Буква>
					|</ТерминГлоссария>";

			КонецЕсли;
			
			
		КонецЕсли;

		// ЭлементПредставленияПонятия = Ложь;
		
        // ДЛЯ БУКВ ИЗ ТАБЛИЧНОЙ ЧАСТИ 
		
		Если   (КоличествоВариантов > 0) Тогда
			КоличествоСинонимов = 0;
			Для каждого Вариант Из ТерминыГлоссария.Ссылка.Синонимы Цикл
				Если (КоличествоСинонимов = 0) Тогда
					Если  (Вариант.БукваДляПоиска = БукваДляФильтра И НЕ Вариант.БукваДляПоиска = ТерминыГлоссария.БукваДляПоиска) Тогда
			
						// ЭлементПредставленияПонятия = Истина;
						
						СтруктураДанныхОбъектСУЗТермина = ОбъектыСУЗ.ПолучитьПредставление(ТерминыГлоссария.Ссылка, ПараметрыСсылки, КонтекстВыполнения);
		                                 
						КоличествоСинонимов = 1;
						
		                Если Глоссарий.ПоказыватьСОпределением Тогда
							XMLДанные = XMLДанные + "
								|<ТерминГлоссария id="""+ ТерминыГлоссария.Ссылка.УникальныйИдентификатор() +""">
								|<Наименование><![CDATA["+ Вариант.Представление +"]]></Наименование>
								|<Буква><![CDATA["+ ТерминыГлоссария.БукваДляПоиска +"]]></Буква>
								|<Представление><![CDATA["+ СтруктураДанныхОбъектСУЗТермина.Представление +"]]></Представление>
								|<Скрипт><![CDATA["+ СтруктураДанныхОбъектСУЗТермина.Скрипт +"]]></Скрипт>
								//|<ПредставлениеПонятия><![CDATA["+?(ЭлементПредставленияПонятия, "истина", "ложь")+"]]></ПредставлениеПонятия>
								|</ТерминГлоссария>";
						Иначе  
	                         XMLДанные = XMLДанные + "
								|<ТерминГлоссария id="""+ ТерминыГлоссария.Ссылка.УникальныйИдентификатор() +""">
								|<Наименование><![CDATA["+ Вариант.Представление +"]]></Наименование>
								|<Буква><![CDATA["+ ТерминыГлоссария.БукваДляПоиска +"]]></Буква>
								//|<Представление><![CDATA["+ HTMLПредставлениеТерма +"]]></Представление>
								//|<Скрипт><![CDATA["+ ТекстСкриптаТерма +"]]></Скрипт>
								//|<ПредставлениеПонятия><![CDATA["+?(ЭлементПредставленияПонятия, "истина", "ложь")+"]]></ПредставлениеПонятия>
								|</ТерминГлоссария>";
							КонецЕсли;

					КонецЕсли;
				КонецЕсли;
		 	КонецЦикла;
        КонецЕсли;

  	КонецЦикла;
	   
	   	   
	// удаляем из массива повторяющиеся элементы
	ТекущийИндекс =  0;
	ЭлементыЦ = МассивЦифры.Количество();
	ВсегоЭлементов = МассивБукв.Количество();
	Пока ТекущийИндекс < ВсегоЭлементов Цикл
		Индекс2= ТекущийИндекс+1;
		Пока Индекс2<ВсегоЭлементов Цикл
			Если МассивБукв[Индекс2] = МассивБукв[ТекущийИндекс] Тогда
				МассивБукв.Удалить(Индекс2);
				ВсегоЭлементов = ВсегоЭлементов-1;
			Иначе 
				Индекс2=Индекс2+1;
			КонецЕсли;
		КонецЦикла;
			  
	// проверяем является ли английской буквой
		АнглийскийАлфавит = 0;
		КолАнглБукв = МассивАнглАлфавит.Количество();
		Для Буква = 0 По КолАнглБукв -1 Цикл
			Если МассивБукв[ТекущийИндекс]= МассивАнглАлфавит[Буква]  Тогда 	  
				АнглийскийАлфавит = 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;

	// проверяем является ли буквой  
		Попытка 
			ЯвляетсяЧислом = Число(МассивБукв[ТекущийИндекс]);
		Исключение 
			Если АнглийскийАлфавит = 0 Тогда
				XMLДанные = XMLДанные + "
					|<Алфавит>
					|<БукваГлоссария flag=""gl""><![CDATA["+ МассивБукв[ТекущийИндекс] +"]]></БукваГлоссария>
					|</Алфавит>";
			КонецЕсли;
	    КонецПопытки;						
		ТекущийИндекс= ТекущийИндекс+1;
	КонецЦикла;
		  
	                                    
	// Помечаем буквы алфавита 	  
	Элементы1 = МассивВесьАлфавит.Количество();
	Элементы2= МассивБукв.Количество();
	
	Для Индекс1=0 По Элементы1-1 Цикл		
			Существует = 0;
			Для Индекс2=0 По Элементы2-1 Цикл
				Если (МассивВесьАлфавит[Индекс1]= МассивБукв[Индекс2] )Тогда
					            Существует =1;
								Прервать;
								КонецЕсли;
							КонецЦикла;
							
			Если Существует = 0 Тогда 				
				XMLДанные = XMLДанные + "
					|<Алфавит>
					|<БукваГлоссария flag=""alf""><![CDATA["+ МассивВесьАлфавит[Индекс1] +"]]></БукваГлоссария>
					|</Алфавит>";
            КонецЕсли;
		КонецЦикла;
		
	// помечаем цифры	
	ЭлементыЦ1 = МассивЦифры.Количество();
	ВНаличии = Ложь;
	Для ИндексЦ1=0 По ЭлементыЦ1-1 Цикл		
		Существует1 = 0;
		ВНаличии = 0;
		Для ИндексЦ2=0 По Элементы2-1 Цикл
			Если МассивЦифры[ИндексЦ1]= МассивБукв[ИндексЦ2] Тогда
				Существует1 =1;
				ВНаличии = Истина;
				XMLДанные = XMLДанные + "
					|<Цифры>
					|<ЦифрыГлоссария flag=""dig""><![CDATA["+ МассивЦифры[ИндексЦ1] +"]]></ЦифрыГлоссария>
					|</Цифры>";

				Прервать;
			КонецЕсли;
		КонецЦикла;
							
		Если Существует1 = 0 Тогда 				
			XMLДанные = XMLДанные + "
				|<Цифры>
				|<ЦифрыГлоссария flag=""notdig""><![CDATA["+ МассивЦифры[ИндексЦ1] +"]]></ЦифрыГлоссария>
				|</Цифры>";
		КонецЕсли;
				
		XMLДанные = XMLДанные + "
			|<НастройкиПоиска>
			|<НаличиеЦифры>"+?(ВНаличии, "истина", "ложь")+"</НаличиеЦифры>
			|</НастройкиПоиска>";
	КонецЦикла;		
		
	// помечаем английские буквы
	ЭлементыАБ = МассивАнглАлфавит.Количество();
	ВНаличииАБ = Ложь;
	Для ИндексАБ=0 По ЭлементыАБ-1 Цикл		
		Существует2 = 0;
		Для ИндексАБ2=0 По Элементы2-1 Цикл
			Если МассивАнглАлфавит[ИндексАБ]= МассивБукв[ИндексАБ2] Тогда
				Существует2 =1;
				ВНаличииАБ = Истина;
				XMLДанные = XMLДанные + "
					|<АнглБуквы>
					|<АБуквыГлоссария flag=""eng""><![CDATA["+ МассивАнглАлфавит[ИндексАБ] +"]]></АБуквыГлоссария>
					|</АнглБуквы>";
				Прервать;
			КонецЕсли;
		КонецЦикла;
							
		Если Существует2 = 0 Тогда 				
			XMLДанные = XMLДанные + "
				|<АнглБуквы>
				|<АБуквыГлоссария flag=""noteng""><![CDATA["+ МассивАнглАлфавит[ИндексАБ] +"]]></АБуквыГлоссария>
				|</АнглБуквы>";
		КонецЕсли;
				
		XMLДанные = XMLДанные + "
			|<НастройкиПоиска>
			|<НаличиеАБуквы>"+?(ВНаличииАБ, "истина", "ложь")+"</НаличиеАБуквы>
			|</НастройкиПоиска>";

	КонецЦикла;

	
	XMLДанные = XMLДанные + "</ТерминыГлоссария>";	
	XMLДанные = XMLДанные + "</Глоссарий>";
	XMLДанные = XMLДанные + "</ОбъектСУЗ>";
		
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Глоссарий);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);

	Возврат XMLДанные;


КонецФункции

Процедура ДобавитьТерминВГлоссарий(Термин, Глоссарий, СкрытьАвтоСсылки = Ложь) Экспорт
	
	Если ТипЗнч(Термин) = Тип("Массив") Тогда
		МассивЭлементов = Термин;
	Иначе
		МассивЭлементов = Новый Массив();
		МассивЭлементов.Добавить(Термин);
	КонецЕсли;
	
	Если МассивЭлементов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Выбираем все термины из массива и термины возможных групп

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерминыСУЗ.Ссылка КАК Термин
		|ИЗ
		|	Справочник.ТерминыСУЗ КАК ТерминыСУЗ
		|ГДЕ
		|	(ТерминыСУЗ.Ссылка В ИЕРАРХИИ (&МассивТерминов)
		|			ИЛИ ТерминыСУЗ.Ссылка В (&МассивТерминов))
		|	И ТерминыСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И ТерминыСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("МассивТерминов", МассивЭлементов);

	Результат           = Запрос.Выполнить();
	ТаблицаРезультатов  = Результат.Выгрузить();
	
	МассивТерминов = ТаблицаРезультатов.ВыгрузитьКолонку("Термин");
	
	// Ищем термины в глоссарии
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария КАК Термин,
		|	СодержаниеГлоссарияСУЗ.Ссылка
		|ИЗ
		|	Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссарияСУЗ
		|ГДЕ
		|	СодержаниеГлоссарияСУЗ.Владелец = &Глоссарий
		|	И СодержаниеГлоссарияСУЗ.ТерминГлоссария В(&МассивЭлементов)";

	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);
	Запрос.УстановитьПараметр("МассивЭлементов", МассивТерминов);

	Результат = Запрос.Выполнить();
    ТаблицаЭлементовГлоссария = Результат.Выгрузить();

	// Добавляем термины в глоссарий
	
	Для каждого СсылкаНаТермин Из МассивТерминов Цикл
		
		НайденнаяСтрока = ТаблицаЭлементовГлоссария.Найти(СсылкаНаТермин, "Термин");
		
		Если НайденнаяСтрока = Неопределено Тогда
		
			ЭлементГлоссарияОбъект = Справочники.СодержаниеГлоссарияСУЗ.СоздатьЭлемент();
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементГлоссарияОбъект);
			
			ЭлементГлоссарияОбъект.Владелец         = Глоссарий;
			ЭлементГлоссарияОбъект.ТерминГлоссария  = СсылкаНаТермин; 
			
		Иначе
			
			ЭлементГлоссарияОбъект = НайденнаяСтрока.Ссылка.ПолучитьОбъект();
			
		КонецЕсли;
			
		ЭлементГлоссарияОбъект.СкрытьАвтоСсылки = СкрытьАвтоСсылки;
		
		ЭлементГлоссарияОбъект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

Функция Термины(Глоссарий = Неопределено, ПолучатьОпределение = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.Наименование КАК Наименование,
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.Синонимы.(
		|		Представление КАК НаименованиеСинонима,
		|		БукваДляПоиска КАК БукваДляПоискаСинонима
		|	) КАК Синонимы,
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.Ссылка КАК Термин,
		|	СодержаниеГлоссарияСУЗ.СкрытьАвтоСсылки КАК СкрытьАвтоСсылки,
		|	СодержаниеГлоссарияСУЗ.ТерминГлоссария.БукваДляПоиска КАК БукваДляПоиска
		|ИЗ
		|	Справочник.СодержаниеГлоссарияСУЗ КАК СодержаниеГлоссарияСУЗ
		|ГДЕ
		|	СодержаниеГлоссарияСУЗ.Владелец = &Глоссарий
		|	И СодержаниеГлоссарияСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Глоссарий", Глоссарий);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
	Если ПолучатьОпределение Тогда
		
		// Получаем таблицу определений
		
		МассивТерминов = Новый Массив();

		Пока ВыборкаДетальныеЗаписи.Следующий()
			И МассивТерминов.Найти(ВыборкаДетальныеЗаписи.Термин) = Неопределено Цикл	
			
			МассивТерминов.Добавить(ВыборкаДетальныеЗаписи.Термин);
			
		КонецЦикла;
		
		ВыборкаДетальныеЗаписи.Сбросить();

		ЗапросОпределений = Новый Запрос;
		ЗапросОпределений.Текст = 
			"ВЫБРАТЬ
			|	ОпределенияТерминаСУЗ.Текст,
			|	ОпределенияТерминаСУЗ.Владелец КАК Термин
			|ИЗ
			|	Справочник.ОпределенияТерминаСУЗ КАК ОпределенияТерминаСУЗ
			|ГДЕ
			|	ОпределенияТерминаСУЗ.Владелец В(&Термины)";

		ЗапросОпределений.УстановитьПараметр("Термины", МассивТерминов);

		ТаблицаОпределений = ЗапросОпределений.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	ТаблицаТерминов = Новый ТаблицаЗначений;
	ТаблицаТерминов.Колонки.Добавить("Термин");
	ТаблицаТерминов.Колонки.Добавить("ТекстоваяСсылка");
	ТаблицаТерминов.Колонки.Добавить("Наименование");
	ТаблицаТерминов.Колонки.Добавить("ДлинаТермина");
	ТаблицаТерминов.Колонки.Добавить("Определение");
	ТаблицаТерминов.Колонки.Добавить("БукваДляПоиска");
	ТаблицаТерминов.Колонки.Добавить("СкрытьАвтоСсылки");
	ТаблицаТерминов.Колонки.Добавить("ЭтоСиноним");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекстОпределения = "";
		
		Если ПолучатьОпределение Тогда
			
			МассивОпределений = ТаблицаОпределений.НайтиСтроки(Новый Структура("Термин", ВыборкаДетальныеЗаписи.Термин));
			
			Для каждого Определение Из МассивОпределений Цикл
			
				ТекстОпределения = ТекстОпределения + Определение.Текст + Символы.ПС; 	
			
			КонецЦикла;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаТерминов.Добавить();
		НоваяСтрока.Термин           = ВыборкаДетальныеЗаписи.Термин;
		НоваяСтрока.ТекстоваяСсылка  = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ВыборкаДетальныеЗаписи.Термин, "new");
		НоваяСтрока.Наименование     = НРег(ВыборкаДетальныеЗаписи.Наименование);
		НоваяСтрока.ДлинаТермина     = СтрДлина(ВыборкаДетальныеЗаписи.Наименование);
		НоваяСтрока.Определение      = ТекстОпределения;
		НоваяСтрока.СкрытьАвтоСсылки = ВыборкаДетальныеЗаписи.СкрытьАвтоСсылки;
		НоваяСтрока.БукваДляПоиска   = ВыборкаДетальныеЗаписи.БукваДляПоиска;
		НоваяСтрока.ЭтоСиноним       = Ложь;
		
		ВыборкаСинонимов = ВыборкаДетальныеЗаписи.Синонимы.Выбрать();
		
		Пока ВыборкаСинонимов.Следующий() Цикл
			
			НоваяСтрока = ТаблицаТерминов.Добавить();
			НоваяСтрока.Термин           = ВыборкаДетальныеЗаписи.Термин;
			НоваяСтрока.ТекстоваяСсылка  = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ВыборкаДетальныеЗаписи.Термин, "new");
			НоваяСтрока.Наименование     = НРег(ВыборкаСинонимов.НаименованиеСинонима);
			НоваяСтрока.ДлинаТермина     = СтрДлина(ВыборкаСинонимов.НаименованиеСинонима);
			НоваяСтрока.Определение      = ТекстОпределения;
			НоваяСтрока.СкрытьАвтоСсылки = ВыборкаДетальныеЗаписи.СкрытьАвтоСсылки;
			НоваяСтрока.БукваДляПоиска   = ВыборкаСинонимов.БукваДляПоискаСинонима;
			НоваяСтрока.ЭтоСиноним       = Истина;
			
		КонецЦикла;			
		
	КонецЦикла;

	// Сортируем таблицу терминов по убыванию длины термина,
	// Чтобы более общие термины заменялись в перую очередь
	ТаблицаТерминов.Сортировать("ДлинаТермина УБЫВ");
	
	Возврат ТаблицаТерминов;
	
КонецФункции

// Возвращает группу, в которой хранятся элементы глоссария.
// В случае ее отсутствия, создает новую.
//
Функция ГруппаПодчиненныхЭлементов(Знач Глоссарий, Знач ТипПодчиненногоЭлемента, Знач ЭлектронныйРесурс=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Глоссарий)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыОбъектовСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Глоссарий, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Глоссарий, "Наименование");
	
		Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			НоваяГруппаОбъект.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Электронныйресурс, ТипПодчиненногоЭлемента);	
		КонецЕсли;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыОбъектовСУЗ.СохранитьГруппуДляХраненияПодчиненныхЭлементов(Глоссарий, ГруппаПодчиненныхЭлементов);		
				
	КонецЕсли;

	Возврат ГруппаПодчиненныхЭлементов;

КонецФункции

#КонецЕсли
